Revit 2027 API
IFCAnyHandle.SetAttribute(String, IList<String>) Method
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetAttribute(
	string name,
	IList<string> values
)
Public Sub SetAttribute (
	name As String,
	values As IList(Of String)
)
public:
void SetAttribute(
	String^ name,
	IList<String^>^ values
)
member SetAttribute :
        name : string *
        values : IList<string> -> unit
Parameters
name String
values IList<String>
See Also
Reference
IFCAnyHandle Class
SetAttribute Overload
Autodesk.Revit.DB.IFC Namespace